{"config": [{"config": {"mask_value": -1, "dtype": "float32", "trainable": true, "batch_input_shape": [null, 5, 56], "name": "masking_1"}, "class_name": "Masking"}, {"config": {"recurrent_activation": "hard_sigmoid", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "go_backwards": false, "unit_forget_bias": true, "kernel_constraint": null, "recurrent_regularizer": null, "return_sequences": false, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "recurrent_dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "unroll": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "bias_constraint": null, "stateful": false, "units": 32, "activation": "tanh", "name": "lstm_1", "return_state": false, "activity_regularizer": null, "implementation": 0, "recurrent_constraint": null}, "class_name": "LSTM"}, {"config": {"activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dtype": "float32", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 34, "batch_input_shape": [null, 32], "name": "dense_1", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_1"}, "class_name": "Activation"}], "keras_version": "2.0.8", "class_name": "Sequential", "backend": "tensorflow"}