{"config": [{"config": {"dtype": "float32", "name": "masking_1", "mask_value": -1, "trainable": true, "batch_input_shape": [null, 3, 12]}, "class_name": "Masking"}, {"config": {"units": 32, "batch_input_shape": [null, 3, 12], "use_bias": true, "kernel_regularizer": null, "unroll": false, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "unit_forget_bias": true, "return_state": false, "activation": "tanh", "stateful": false, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "return_sequences": false, "name": "lstm_1", "go_backwards": false, "recurrent_regularizer": null, "recurrent_constraint": null, "implementation": 1, "recurrent_dropout": 0.0, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "dropout": 0.2}, "class_name": "LSTM"}, {"config": {"units": 6, "kernel_constraint": null, "batch_input_shape": [null, 32], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "use_bias": true, "name": "dense_1", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "keras_version": "2.1.6", "class_name": "Sequential", "backend": "tensorflow"}